# Pandas Series-4

In [3]:
import pandas as pd
import numpy as np

date = pd.date_range('20191010', periods=6)
date

DatetimeIndex(['2019-10-10', '2019-10-11', '2019-10-12', '2019-10-13',
               '2019-10-14', '2019-10-15'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4) , index=date, columns=list("ABCD"))
df

                   A         B         C         D
2019-10-10  1.199363 -1.670581 -0.645387 -0.397688
2019-10-11 -0.753894 -0.508239  0.846674 -0.847872
2019-10-12  0.698953 -0.986570 -1.597400 -1.080876
2019-10-13 -1.340884 -1.392228  0.959901  0.229092
2019-10-14 -1.286765  1.207339 -0.455099 -1.145806
2019-10-15 -0.060954  0.890254  0.839949  0.053746

In [7]:
df.index

DatetimeIndex(['2019-10-10', '2019-10-11', '2019-10-12', '2019-10-13',
               '2019-10-14', '2019-10-15'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [9]:
df.to_numpy

<bound method DataFrame.to_numpy of                    A         B         C         D
2019-10-10  1.199363 -1.670581 -0.645387 -0.397688
2019-10-11 -0.753894 -0.508239  0.846674 -0.847872
2019-10-12  0.698953 -0.986570 -1.597400 -1.080876
2019-10-13 -1.340884 -1.392228  0.959901  0.229092
2019-10-14 -1.286765  1.207339 -0.455099 -1.145806
2019-10-15 -0.060954  0.890254  0.839949  0.053746>

In [10]:
df.T

   2019-10-10  2019-10-11  2019-10-12  2019-10-13  2019-10-14  2019-10-15
A    1.199363   -0.753894    0.698953   -1.340884   -1.286765   -0.060954
B   -1.670581   -0.508239   -0.986570   -1.392228    1.207339    0.890254
C   -0.645387    0.846674   -1.597400    0.959901   -0.455099    0.839949
D   -0.397688   -0.847872   -1.080876    0.229092   -1.145806    0.053746

In [17]:
x = [[1,23,45],[23,25,25],[87,34,20]]
df2= pd.DataFrame(x)
df2.T

    0   1   2
0   1  23  87
1  23  25  34
2  45  25  20

In [22]:
df2.sort_index(axis=1, ascending=True)

    0   1   2
0   1  23  45
1  23  25  25
2  87  34  20

In [30]:
df2[:3]

    0   1   2
0   1  23  45
1  23  25  25
2  87  34  20

In [39]:
x = [[1,23,45],[23,25,np.nan],[87,34,np.nan]]
df3= pd.DataFrame(x)
df3

    0   1     2
0   1  23  45.0
1  23  25   NaN
2  87  34   NaN

In [40]:
df3.fillna(value=10)

    0   1     2
0   1  23  45.0
1  23  25  10.0
2  87  34  10.0

In [43]:
pd.isna(df2)

       0      1      2
0  False  False  False
1  False  False  False
2  False  False  False

In [46]:
df3.mean()

0    37.000000
1    27.333333
2    45.000000
dtype: float64

In [47]:
df3.mean(1)

0    23.0
1    24.0
2    60.5
dtype: float64

In [48]:
df.apply(np.cumsum)

                   A         B         C         D
2019-10-10  1.199363 -1.670581 -0.645387 -0.397688
2019-10-11  0.445469 -2.178820  0.201287 -1.245560
2019-10-12  1.144422 -3.165390 -1.396112 -2.326435
2019-10-13 -0.196461 -4.557617 -0.436212 -2.097344
2019-10-14 -1.483227 -3.350279 -0.891311 -3.243150
2019-10-15 -1.544181 -2.460025 -0.051362 -3.189404

In [50]:
df3.sum()

0    111.0
1     82.0
2     45.0
dtype: float64

In [51]:
df.min()

A   -1.340884
B   -1.670581
C   -1.597400
D   -1.145806
dtype: float64

In [52]:
df2.max()

0    87
1    34
2    45
dtype: int64